import type { ITimeInterval } from '@/types/timeInterval.types';

export const TimeIntervals: ITimeInterval[] = [
  {
    id: 1,
    firstYear: '1980',
    secondYear: '1986',
    headers: 'Технологии',
    info: [
      {
        title: '1980',
        description: 'Sinclair Research выпускает домашний компьютер ZX80'
      },
      {
        title: '1982',
        description:
          'ZX Spectrum — 8-разрядный домашний компьютер, созданный британской компанией «Sinclair Research Ltd» на основе микропроцессора Zilog Z80'
      },
      {
        title: '1983',
        description: 'Появились компакт-диски, которые проигрывали контент без каких-либо звуковых искажений.'
      },
      {
        title: '1984',
        description: 'Компания Apple представила миру Macintosh.'
      },
      {
        title: '1986',
        description:
          'Базовый блок многомодульной орбитальной станции «Мир» был выведен на орбиту ракетой носителем «Протон»'
      }
    ]
  },
  {
    id: 2,
    firstYear: '1987',
    secondYear: '1991',
    headers: 'Кино',
    info: [
      {
        title: '1987',
        description: '«Хищник»/Predator, США (реж. Джон Мактирнан) '
      },
      {
        title: '1988',
        description: '«Кто подставил кролика Роджера»/Who Framed Roger Rabbit, США (реж. Роберт Земекис)'
      },
      {
        title: '1989',
        description: '«Назад в будущее 2»/Back To The Future 2, США (реж. Роберт Земекис)'
      },
      {
        title: '1990',
        description: '«Крепкий орешек 2»/Die Hard 2, США (реж. Ренни Харлин)'
      },
      {
        title: '1991',
        description: '«Семейка Аддамс»/The Addams Family, США (реж. Барри Зонненфельд)'
      }
    ]
  },
  {
    id: 3,
    firstYear: '1992',
    secondYear: '1997',
    headers: 'Литература',
    info: [
      {
        title: '1992',
        description:
          'Нобелевская премия по литературе - Дерек Уолкотт, «За блестящий образец карибского эпоса в 64 разделах»'
      },
      {
        title: '1994',
        description: '«Бессоница» - роман Стивена Кинга в жанре ужасов и фэнтези.'
      },
      {
        title: '1995',
        description:
          'Нобелевская премия по литературе — Шеймас Хини, «За лирическую красоту и этическую глубину поэзии, открывающую перед нами удивительные будни и оживающее прошлое»'
      },
      {
        title: '1997',
        description:
          'В Лондоне издательством Bloomsbury Publishing тиражом в 500 экземпляров опубликован первый роман Дж. К. Роулинг о Гарри Поттере «Гарри Поттер и философский камень»'
      }
    ]
  },
  {
    id: 4,
    firstYear: '1998',
    secondYear: '2005',
    headers: 'Экономика',
    info: [
      {
        title: '1998',
        description:
          'Россия пережила финансовый кризис (декабрь 1998): дефолт по внутренним долгам, девальвация рубля, экономический спад.'
      },
      {
        title: '1999',
        description: 'Вступление Евросоюза в 1999 году: создание Евро как единой валюты для 11 стран-членов.'
      },
      {
        title: '2000',
        description:
          'Пузырь доткомов: на фондовых рынках США и мира наблюдался бум технологических компаний, который завершился крахом в 2000–2001 годах.'
      },
      {
        title: '2001',
        description:
          'Террористические атаки 11 сентября в США: оказали значительное влияние на мировую экономику, вызвали спад в туристической, авиационной и страховой сферах'
      },
      {
        title: '2003',
        description: 'Война в Ираке: оказала влияние на нефтяные цены и геополитическую ситуацию.'
      },
      {
        title: '2005',
        description: 'Взрыв нефтяных цен, достигших рекордных уровней'
      }
    ]
  },
  {
    id: 5,
    firstYear: '2006',
    secondYear: '2014',
    headers: 'Спорт',
    info: [
      {
        title: '2006',
        description: 'Баскетбольный клуб ЦСКА стал победителем национального первенства России'
      },
      {
        title: '2008',
        description: 'С 8 по 24 августа в Пекине прошли 29 летние Олимпийские игры'
      },
      {
        title: '2010',
        description: '13 - 28 февраля в Ванкувере: Зимние Олимпийские игры 2010 года '
      },
      {
        title: '2012',
        description: '2 августа - Летние Олимпийские игры'
      },
      {
        title: '2014',
        description: 'XXII зимние Олимпийские игры (Сочи, Россия)'
      }
    ]
  },
  {
    id: 6,
    firstYear: '2015',
    secondYear: '2022',
    headers: 'Наука',
    info: [
      {
        title: '2015',
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
      },
      {
        title: '2016',
        description:
          'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11'
      },
      {
        title: '2017',
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
      },
      {
        title: '2018',
        description: 'Старт космического аппарата Solar Probe Plus, предназначенного для изучения Солнца'
      },
      {
        title: '2019',
        description: 'Google объявил о создании 53-кубитного квантого компьютера'
      },
      {
        title: '2022',
        description: 'Получены первые изображения от космического телескопа Джеймса Уэбба.'
      }
    ]
  }
];
